lab11_ci/ci4/app/Controllers/Artikel.php

    public function index()
    {
        $q = $this->request->getVar('q') ?? '';

        $data = [
            'title'   => 'Daftar Artikel',
            'q'       => $q,
            'artikel' => $this->artikelModel->select('artikel.*, kategori.nama_kategori')
                            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left')
                            ->like('artikel.judul', $q)
                            ->paginate(6, 'artikel'),
---
SELECT COUNT(*) AS `numrows`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`judul` LIKE '%%' ESCAPE '!'
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`judul` LIKE '%%' ESCAPE '!'
 LIMIT 6

    public function view($slug)
    {
        $artikel = $this->artikelModel->select('artikel.*, kategori.nama_kategori')
                                      ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left')
                                      ->where('slug', $slug)->first();
---
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `slug` = 'valorant-episode-baru-duelist-baru-beneran-overpowered-atau-cuma-hype-semata'
 LIMIT 1

    public function admin_index()
    {
        $title = 'Halaman Admin - Artikel';

        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';
        $page = $this->request->getVar('page') ?? 1;

        // Ditampung ke variabel $builder agar query-nya stabil dan terikat dengan benar
        $builder = $this->artikelModel->select('artikel.*, kategori.nama_kategori')
                                      ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left');

        if ($q != '') {
            $builder->like('artikel.judul', $q);
        }

        if ($kategori_id != '') {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        // Ambil data dengan pagination teratur
        $artikel = $builder->orderBy('artikel.id', 'DESC')->paginate(10, 'artikel', $page);
---
SELECT COUNT(*) AS `numrows`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
ORDER BY `artikel`.`id` DESC
 LIMIT 10

            'title'       => $title,
            'q'           => $q,
            'kategori_id' => $kategori_id,
            'kategori'    => $this->kategoriModel->findAll()
---
SELECT *
FROM `kategori`

    public function add()
    {
        if ($this->request->is('post')) {
            $fileGambar = $this->request->getFile('gambar');
            $namaGambar = null;

            if ($fileGambar && $fileGambar->isValid() && !$fileGambar->hasMoved()) {
                $namaGambar = $fileGambar->getRandomName();
                $fileGambar->move('uploads', $namaGambar);
            }

            $this->artikelModel->save([
                'judul'       => $this->request->getPost('judul'),
                'id_kategori' => $this->request->getPost('id_kategori'),
                'isi'         => $this->request->getPost('isi'),
                'status'      => $this->request->getPost('status') ?? 1,
                'gambar'      => $namaGambar,
                'slug'        => url_title($this->request->getPost('judul'), '-', true)
            ]);

            session()->setFlashdata('pesan', 'Artikel berhasil diterbitkan!');
            return redirect()->to('/admin/artikel');
        }

        return view('admin/artikel_add', [
            'title'    => 'Tambah Artikel',
            'kategori' => $this->kategoriModel->findAll()
---
INSERT INTO `artikel` (`judul`, `id_kategori`, `isi`, `status`, `gambar`, `slug`) VALUES ('Valorant Episode Baru: Duelist Baru Beneran Overpowered atau Cuma Hype Semata?', '2', 'ga tau lupaa', '0', NULL, 'valorant-episode-baru-duelist-baru-beneran-overpowered-atau-cuma-hype-semata')
SELECT *
FROM `kategori`